Repository: ArpicoIT/ArpicoPrivilege
Catalog: lib/l10n/alerts_*.arb
Languages: si

# alerts_failed_title
source: Something Went Wrong
si: කිසියම් දෝෂයක් සිදු විය

# alerts_failed_description
source: An unexpected error occurred. Please try again later.
si: අනපේක්ෂිත දෝෂයක් සිදු විය. කරුණාකර පසුව නැවත උත්සාහ කරන්න.

# alerts_not_found_title
source: Not Found
si: දත්ත සොයාගත නොහැක

# alerts_not_found_description
source: The requested data was not found.
si: අදාළ දත්ත හමු නොවීය.

# alerts_no_content_title
source: No Content
si: අන්තර්ගතය නැත

# alerts_no_content_description
source: There is nothing to display.
si: පෙන්වීමට කිසිවක් නොමැත.

# alerts_timeout_title
source: Timeout
si: වේලාව ඉක්මවා ගියා

# alerts_timeout_description
source: The connection timed out. Please try again.
si: සම්බන්ධතාවය වේලාව ඉක්මවා ගියේය. කරුණාකර නැවත උත්සාහ කරන්න.

# alerts_connection_error_title
source: Connection Error
si: සම්බන්ධතා දෝෂයක්

# alerts_connection_error_description
source: Network connection failed. Please check your connection.
si: ජාල සම්බන්ධතාවය අසාර්ථක විය. කරුණාකර සම්බන්ධතාවය පරීක්ෂා කරන්න.

# alerts_internal_server_error_title
source: Internal Server Error
si: සේවාදායක දෝෂයක්

# alerts_internal_server_error_description
source: A server error occurred. Please try again later.
si: සේවාදායකයේ දෝෂයක් ඇතිව ඇත. පසුව නැවත උත්සාහ කරන්න.

# alerts_empty_bills_title
source: No E-Bills Found
si: බිල්පත් හමු නොවීය

# alerts_empty_bills_description
source: You havenâ€™t received any e-bills yet.
si: ඔබට කිසිදු බිල්පතක් ලබා නොදී ඇත.

# alerts_empty_promotions_title
source: No Promotions
si: ප්‍රවර්ධන නොමැත

# alerts_empty_promotions_description
source: There are no promotions available at this time.
si: මෙතැන ප්‍රවර්ධන කිසිවක් නොමැත.

# alerts_empty_notifications_title
source: No Notifications
si: සැලකිලි නොමැත

# alerts_empty_notifications_description
source: You have no new notifications.
si: නව දැනුම්දීම් නොමැත.

# alerts_empty_reviews_title
source: No Reviews
si: සමාලෝචන නොමැත

# alerts_empty_reviews_description
source: There are no reviews for this item.
si: මෙම වස්තුව සඳහා කිසිදු සමාලෝචනයක් නොමැත.

# alerts_empty_transactions_title
source: No Transactions
si: ගනුදෙනු නොමැත

# alerts_empty_transactions_description
source: You have no transactions.
si: ඔබට කිසිදු ගනුදෙනුවක් නොමැත.

# alerts_issue_submitted_title
source: Issue Submitted
si: ගැටලුව ඉදිරිපත් කර ඇත

# alerts_issue_submitted_description
source: Your issue has been successfully submitted.
si: ඔබගේ ගැටලුව සාර්ථකව ලැබී ඇත.

# alerts_feedback_submitted_title
source: Feedback Submitted
si: ප්‍රතිචාර යොමු කරන ලදී

# alerts_feedback_submitted_description
source: Your feedback has been successfully received.
si: ඔබගේ ප්‍රතිචාර අප වෙත සාර්ථකව ලැබී ඇත.

# alerts_profile_updated_title
source: Profile Updated
si: සැකසුම් සාර්ථකයි

# alerts_profile_updated_description
source: Your profile has been updated successfully.
si: ඔබගේ පැතිකඩ යාවත්කාලීන කර ඇත.

# alerts_ebill_registered_title
source: You're Now Registered for E-Bills
si: ඔබ දැන් ඊ-බිල් සේවාවට ලියාපදිංචි වී ඇත

# alerts_ebill_registered_description
source: Your bills will now appear right in the app and may also be sent via SMS. Enjoy clutter-free convenience!
si: ඔබගේ බිල්පත් දැන් යෙදුමේ තුළ සහ SMS මඟින් ලබා ගත හැක. කඩදාසි රහිත පහසුව විඳින්න!

# actions_retry
source: Retry
si: නැවත උත්සාහය

# actions_refresh
source: Refresh
si: නැවත උත්සාහය

# actions_ok
source: OK
si: හරි

# actions_cancel
source: Cancel
si: අවලංගු කරන්න

# actions_done
source: Done
si: සම්පූර්ණයි

# actions_got_it
source: Got It
si: හොඳයි
